Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam3s8/libraries/libchip_sam3s/include/SAM3S16.h
/* ---------------------------------------------------------------------------- */
/*                  ATMEL Microcontroller Software Support                      */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2011, ATMEL Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef SAM3S16_H
#define SAM3S16_H

/** \addtogroup SAM3S16_definitions SAM3S16 definitions
  This file defines all structures and symbols for SAM3S16:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#ifndef __ASSEMBLY__
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg; /**< Read only 32-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg; /**< Read only 32-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg; /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg; /**< Read-Write 32-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *)(value))
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else
#define CAST(type, value) (value) 
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM3S16 */
/* ************************************************************************** */
/** \addtogroup SAM3S16_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M3 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M3 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M3 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M3 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M3 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M3 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M3 System Tick Interrupt       */
/******  SAM3S16 specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAM3S16 Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM3S16 Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM3S16 Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM3S16 Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM3S16 Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM3S16 Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAM3S16 Enhanced Embedded Flash Controller (EFC) */
  UART0_IRQn           =  8, /**<  8 SAM3S16 UART 0 (UART0) */
  UART1_IRQn           =  9, /**<  9 SAM3S16 UART 1 (UART1) */
  SMC_IRQn             = 10, /**< 10 SAM3S16 SMC (SMC) */
  PIOA_IRQn            = 11, /**< 11 SAM3S16 Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 12, /**< 12 SAM3S16 Parallel I/O Controller B (PIOB) */
  PIOC_IRQn            = 13, /**< 13 SAM3S16 Parallel I/O Controller C (PIOC) */
  USART0_IRQn          = 14, /**< 14 SAM3S16 USART 0 (USART0) */
  USART1_IRQn          = 15, /**< 15 SAM3S16 USART 1 (USART1) */
  HSMCI_IRQn           = 18, /**< 18 SAM3S16 High Speed Multimedia Card Interface (HSMCI) */
  TWI0_IRQn            = 19, /**< 19 SAM3S16 Two Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 20, /**< 20 SAM3S16 Two Wire Interface 1 (TWI1) */
  SPI_IRQn             = 21, /**< 21 SAM3S16 Serial Peripheral Interface (SPI) */
  SSC_IRQn             = 22, /**< 22 SAM3S16 Synchronous Serial Controller (SSC) */
  TC0_IRQn             = 23, /**< 23 SAM3S16 Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAM3S16 Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAM3S16 Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 SAM3S16 Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 SAM3S16 Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 SAM3S16 Timer/Counter 5 (TC5) */
  ADC_IRQn             = 29, /**< 29 SAM3S16 Analog-to-Digital Converter (ADC) */
  DACC_IRQn            = 30, /**< 30 SAM3S16 Digital-to-Analog Converter (DACC) */
  PWM_IRQn             = 31, /**< 31 SAM3S16 Pulse Width Modulation (PWM) */
  CRCCU_IRQn           = 32, /**< 32 SAM3S16 CRC Calculation Unit (CRCCU) */
  ACC_IRQn             = 33, /**< 33 SAM3S16 Analog Comparator (ACC) */
  UDP_IRQn             = 34  /**< 34 SAM3S16 USB Device Port (UDP) */
} IRQn_Type;

/**
 * \brief Configuration of the Cortex-M3 Processor and Core Peripherals 
 */

#define __MPU_PRESENT          1 /**< SAM3S16 does provide a MPU */
#define __NVIC_PRIO_BITS       4 /**< SAM3S16 uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig 0 /**< Set to 1 if different SysTick Config is used */

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAM3S16 */
/* ************************************************************************** */
/** \addtogroup SAM3S16_api Peripheral Software API */
/*@{*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Analog Comparator Controller */
/* ============================================================================= */
/** \addtogroup SAM3S16_ACC Analog Comparator Controller */
/*@{*/

