Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam3s8/libraries/libchip_sam3s/include/SAM3S16.h
#define PIO_PA0                    (1u << 0)  /**< \brief Pin Controlled by PA0 */
#define PIO_PA1                    (1u << 1)  /**< \brief Pin Controlled by PA1 */
#define PIO_PA2                    (1u << 2)  /**< \brief Pin Controlled by PA2 */
#define PIO_PA3                    (1u << 3)  /**< \brief Pin Controlled by PA3 */
#define PIO_PA4                    (1u << 4)  /**< \brief Pin Controlled by PA4 */
#define PIO_PA5                    (1u << 5)  /**< \brief Pin Controlled by PA5 */
#define PIO_PA6                    (1u << 6)  /**< \brief Pin Controlled by PA6 */
#define PIO_PA7                    (1u << 7)  /**< \brief Pin Controlled by PA7 */
#define PIO_PA8                    (1u << 8)  /**< \brief Pin Controlled by PA8 */
#define PIO_PA9                    (1u << 9)  /**< \brief Pin Controlled by PA9 */
#define PIO_PA10                   (1u << 10) /**< \brief Pin Controlled by PA10 */
#define PIO_PA11                   (1u << 11) /**< \brief Pin Controlled by PA11 */
#define PIO_PA12                   (1u << 12) /**< \brief Pin Controlled by PA12 */
#define PIO_PA13                   (1u << 13) /**< \brief Pin Controlled by PA13 */
#define PIO_PA14                   (1u << 14) /**< \brief Pin Controlled by PA14 */
#define PIO_PA15                   (1u << 15) /**< \brief Pin Controlled by PA15 */
#define PIO_PA16                   (1u << 16) /**< \brief Pin Controlled by PA16 */
#define PIO_PA17                   (1u << 17) /**< \brief Pin Controlled by PA17 */
#define PIO_PA18                   (1u << 18) /**< \brief Pin Controlled by PA18 */
#define PIO_PA19                   (1u << 19) /**< \brief Pin Controlled by PA19 */
#define PIO_PA20                   (1u << 20) /**< \brief Pin Controlled by PA20 */
#define PIO_PA21                   (1u << 21) /**< \brief Pin Controlled by PA21 */
#define PIO_PA22                   (1u << 22) /**< \brief Pin Controlled by PA22 */
#define PIO_PA23                   (1u << 23) /**< \brief Pin Controlled by PA23 */
#define PIO_PA24                   (1u << 24) /**< \brief Pin Controlled by PA24 */
#define PIO_PA25                   (1u << 25) /**< \brief Pin Controlled by PA25 */
#define PIO_PA26                   (1u << 26) /**< \brief Pin Controlled by PA26 */
#define PIO_PA27                   (1u << 27) /**< \brief Pin Controlled by PA27 */
#define PIO_PA28                   (1u << 28) /**< \brief Pin Controlled by PA28 */
#define PIO_PA29                   (1u << 29) /**< \brief Pin Controlled by PA29 */
#define PIO_PA30                   (1u << 30) /**< \brief Pin Controlled by PA30 */
#define PIO_PA31                   (1u << 31) /**< \brief Pin Controlled by PA31 */
#define PIO_PB0                    (1u << 0)  /**< \brief Pin Controlled by PB0 */
#define PIO_PB1                    (1u << 1)  /**< \brief Pin Controlled by PB1 */
#define PIO_PB2                    (1u << 2)  /**< \brief Pin Controlled by PB2 */
#define PIO_PB3                    (1u << 3)  /**< \brief Pin Controlled by PB3 */
#define PIO_PB4                    (1u << 4)  /**< \brief Pin Controlled by PB4 */
#define PIO_PB5                    (1u << 5)  /**< \brief Pin Controlled by PB5 */
#define PIO_PB6                    (1u << 6)  /**< \brief Pin Controlled by PB6 */
#define PIO_PB7                    (1u << 7)  /**< \brief Pin Controlled by PB7 */
#define PIO_PB8                    (1u << 8)  /**< \brief Pin Controlled by PB8 */
#define PIO_PB9                    (1u << 9)  /**< \brief Pin Controlled by PB9 */
#define PIO_PB10                   (1u << 10) /**< \brief Pin Controlled by PB10 */
#define PIO_PB11                   (1u << 11) /**< \brief Pin Controlled by PB11 */
#define PIO_PB12                   (1u << 12) /**< \brief Pin Controlled by PB12 */
#define PIO_PB13                   (1u << 13) /**< \brief Pin Controlled by PB13 */
#define PIO_PB14                   (1u << 14) /**< \brief Pin Controlled by PB14 */
#define PIO_PC0                    (1u << 0)  /**< \brief Pin Controlled by PC0 */
#define PIO_PC1                    (1u << 1)  /**< \brief Pin Controlled by PC1 */
#define PIO_PC2                    (1u << 2)  /**< \brief Pin Controlled by PC2 */
#define PIO_PC3                    (1u << 3)  /**< \brief Pin Controlled by PC3 */
#define PIO_PC4                    (1u << 4)  /**< \brief Pin Controlled by PC4 */
#define PIO_PC5                    (1u << 5)  /**< \brief Pin Controlled by PC5 */
#define PIO_PC6                    (1u << 6)  /**< \brief Pin Controlled by PC6 */
#define PIO_PC7                    (1u << 7)  /**< \brief Pin Controlled by PC7 */
#define PIO_PC8                    (1u << 8)  /**< \brief Pin Controlled by PC8 */
#define PIO_PC9                    (1u << 9)  /**< \brief Pin Controlled by PC9 */
#define PIO_PC10                   (1u << 10) /**< \brief Pin Controlled by PC10 */
#define PIO_PC11                   (1u << 11) /**< \brief Pin Controlled by PC11 */
#define PIO_PC12                   (1u << 12) /**< \brief Pin Controlled by PC12 */
#define PIO_PC13                   (1u << 13) /**< \brief Pin Controlled by PC13 */
#define PIO_PC14                   (1u << 14) /**< \brief Pin Controlled by PC14 */
#define PIO_PC15                   (1u << 15) /**< \brief Pin Controlled by PC15 */
#define PIO_PC16                   (1u << 16) /**< \brief Pin Controlled by PC16 */
#define PIO_PC17                   (1u << 17) /**< \brief Pin Controlled by PC17 */
#define PIO_PC18                   (1u << 18) /**< \brief Pin Controlled by PC18 */
#define PIO_PC19                   (1u << 19) /**< \brief Pin Controlled by PC19 */
#define PIO_PC20                   (1u << 20) /**< \brief Pin Controlled by PC20 */
#define PIO_PC21                   (1u << 21) /**< \brief Pin Controlled by PC21 */
#define PIO_PC22                   (1u << 22) /**< \brief Pin Controlled by PC22 */
#define PIO_PC23                   (1u << 23) /**< \brief Pin Controlled by PC23 */
#define PIO_PC24                   (1u << 24) /**< \brief Pin Controlled by PC24 */
#define PIO_PC25                   (1u << 25) /**< \brief Pin Controlled by PC25 */
#define PIO_PC26                   (1u << 26) /**< \brief Pin Controlled by PC26 */
#define PIO_PC27                   (1u << 27) /**< \brief Pin Controlled by PC27 */
#define PIO_PC28                   (1u << 28) /**< \brief Pin Controlled by PC28 */
#define PIO_PC29                   (1u << 29) /**< \brief Pin Controlled by PC29 */
#define PIO_PC30                   (1u << 30) /**< \brief Pin Controlled by PC30 */
#define PIO_PC31                   (1u << 31) /**< \brief Pin Controlled by PC31 */
/* ========== Pio definition for ADC peripheral ========== */
#define PIO_PA17X1_AD0             (1u << 17) /**< \brief Adc signal: AD0 */ 
#define PIO_PA18X1_AD1             (1u << 18) /**< \brief Adc signal: AD1 */ 
#define PIO_PC13X1_AD10            (1u << 13) /**< \brief Adc signal: AD10 */ 
#define PIO_PC15X1_AD11            (1u << 15) /**< \brief Adc signal: AD11 */ 
#define PIO_PC12X1_AD12            (1u << 12) /**< \brief Adc signal: AD12 */ 
#define PIO_PC29X1_AD13            (1u << 29) /**< \brief Adc signal: AD13 */ 
#define PIO_PC30X1_AD14            (1u << 30) /**< \brief Adc signal: AD14 */ 
#define PIO_PA19X1_AD2_WKUP9       (1u << 19) /**< \brief Adc signal: AD2/WKUP9 */ 
#define PIO_PA20X1_AD3_WKUP10      (1u << 20) /**< \brief Adc signal: AD3/WKUP10 */ 
#define PIO_PB0X1_AD4              (1u << 0)  /**< \brief Adc signal: AD4 */ 
#define PIO_PB1X1_AD5              (1u << 1)  /**< \brief Adc signal: AD5 */ 
#define PIO_PB2X1_AD6_WKUP12       (1u << 2)  /**< \brief Adc signal: AD6/WKUP12 */ 
#define PIO_PB3X1_AD7              (1u << 3)  /**< \brief Adc signal: AD7 */ 
#define PIO_PA21X1_AD8             (1u << 21) /**< \brief Adc signal: AD8 */ 
#define PIO_PA22X1_AD9             (1u << 22) /**< \brief Adc signal: AD9 */ 
#define PIO_PA8B_ADTRG             (1u << 8)  /**< \brief Adc signal: ADTRG */ 
/* ========== Pio definition for DACC peripheral ========== */
#define PIO_PB13X1_DAC0            (1u << 13) /**< \brief Dacc signal: DAC0 */ 
#define PIO_PB14X1_DAC1            (1u << 14) /**< \brief Dacc signal: DAC1 */ 
#define PIO_PA2C_DATRG             (1u << 2)  /**< \brief Dacc signal: DATRG */ 
/* ========== Pio definition for EBI peripheral ========== */
#define PIO_PC18A_A0               (1u << 18) /**< \brief Ebi signal: A0 */ 
#define PIO_PC19A_A1               (1u << 19) /**< \brief Ebi signal: A1 */ 
#define PIO_PC28A_A10              (1u << 28) /**< \brief Ebi signal: A10 */ 
#define PIO_PC29A_A11              (1u << 29) /**< \brief Ebi signal: A11 */ 
#define PIO_PC30A_A12              (1u << 30) /**< \brief Ebi signal: A12 */ 
#define PIO_PC31A_A13              (1u << 31) /**< \brief Ebi signal: A13 */ 
#define PIO_PA18C_A14              (1u << 18) /**< \brief Ebi signal: A14 */ 
#define PIO_PA19C_A15              (1u << 19) /**< \brief Ebi signal: A15 */ 
#define PIO_PA20C_A16              (1u << 20) /**< \brief Ebi signal: A16 */ 
#define PIO_PA0C_A17               (1u << 0)  /**< \brief Ebi signal: A17 */ 
#define PIO_PA1C_A18               (1u << 1)  /**< \brief Ebi signal: A18 */ 
#define PIO_PA23C_A19              (1u << 23) /**< \brief Ebi signal: A19 */ 
#define PIO_PC20A_A2               (1u << 20) /**< \brief Ebi signal: A2 */ 
#define PIO_PA24C_A20              (1u << 24) /**< \brief Ebi signal: A20 */ 
#define PIO_PC16A_A21_NANDALE      (1u << 16) /**< \brief Ebi signal: A21/NANDALE */ 
#define PIO_PC17A_A22_NANDCLE      (1u << 17) /**< \brief Ebi signal: A22/NANDCLE */ 
#define PIO_PA25C_A23              (1u << 25) /**< \brief Ebi signal: A23 */ 
#define PIO_PC21A_A3               (1u << 21) /**< \brief Ebi signal: A3 */ 
#define PIO_PC22A_A4               (1u << 22) /**< \brief Ebi signal: A4 */ 
#define PIO_PC23A_A5               (1u << 23) /**< \brief Ebi signal: A5 */ 
#define PIO_PC24A_A6               (1u << 24) /**< \brief Ebi signal: A6 */ 
#define PIO_PC25A_A7               (1u << 25) /**< \brief Ebi signal: A7 */ 
#define PIO_PC26A_A8               (1u << 26) /**< \brief Ebi signal: A8 */ 
#define PIO_PC27A_A9               (1u << 27) /**< \brief Ebi signal: A9 */ 
#define PIO_PC0A_D0                (1u << 0)  /**< \brief Ebi signal: D0 */ 
#define PIO_PC1A_D1                (1u << 1)  /**< \brief Ebi signal: D1 */ 
#define PIO_PC2A_D2                (1u << 2)  /**< \brief Ebi signal: D2 */ 
#define PIO_PC3A_D3                (1u << 3)  /**< \brief Ebi signal: D3 */ 
#define PIO_PC4A_D4                (1u << 4)  /**< \brief Ebi signal: D4 */ 
#define PIO_PC5A_D5                (1u << 5)  /**< \brief Ebi signal: D5 */ 
#define PIO_PC6A_D6                (1u << 6)  /**< \brief Ebi signal: D6 */ 
#define PIO_PC7A_D7                (1u << 7)  /**< \brief Ebi signal: D7 */ 
#define PIO_PC9A_NANDOE            (1u << 9)  /**< \brief Ebi signal: NANDOE */ 
#define PIO_PC10A_NANDWE           (1u << 10) /**< \brief Ebi signal: NANDWE */ 
#define PIO_PC14A_NCS0             (1u << 14) /**< \brief Ebi signal: NCS0 */ 
#define PIO_PC15A_NCS1             (1u << 15) /**< \brief Ebi signal: NCS1 */ 
#define PIO_PA22C_NCS2             (1u << 22) /**< \brief Ebi signal: NCS2 */ 
#define PIO_PC12A_NCS3             (1u << 12) /**< \brief Ebi signal: NCS3 */ 
#define PIO_PC11A_NRD              (1u << 11) /**< \brief Ebi signal: NRD */ 
#define PIO_PC13A_NWAIT            (1u << 13) /**< \brief Ebi signal: NWAIT */ 
#define PIO_PC8A_NWE               (1u << 8)  /**< \brief Ebi signal: NWE */ 
/* ========== Pio definition for HSMCI peripheral ========== */
#define PIO_PA28C_MCCDA            (1u << 28) /**< \brief Hsmci signal: MCCDA */ 
#define PIO_PA29C_MCCK             (1u << 29) /**< \brief Hsmci signal: MCCK */ 
#define PIO_PA30C_MCDA0            (1u << 30) /**< \brief Hsmci signal: MCDA0 */ 
#define PIO_PA31C_MCDA1            (1u << 31) /**< \brief Hsmci signal: MCDA1 */ 
#define PIO_PA26C_MCDA2            (1u << 26) /**< \brief Hsmci signal: MCDA2 */ 
#define PIO_PA27C_MCDA3            (1u << 27) /**< \brief Hsmci signal: MCDA3 */ 
/* ========== Pio definition for PIOA peripheral ========== */
#define PIO_PA24X1_PIODC0          (1u << 24) /**< \brief Pioa signal: PIODC0 */ 
#define PIO_PA25X1_PIODC1          (1u << 25) /**< \brief Pioa signal: PIODC1 */ 
#define PIO_PA26X1_PIODC2          (1u << 26) /**< \brief Pioa signal: PIODC2 */ 
#define PIO_PA27X1_PIODC3          (1u << 27) /**< \brief Pioa signal: PIODC3 */ 
#define PIO_PA28X1_PIODC4          (1u << 28) /**< \brief Pioa signal: PIODC4 */ 
#define PIO_PA29X1_PIODC5          (1u << 29) /**< \brief Pioa signal: PIODC5 */ 
#define PIO_PA31X1_PIODC7          (1u << 31) /**< \brief Pioa signal: PIODC7 */ 
#define PIO_PA23X1_PIODCCLK        (1u << 23) /**< \brief Pioa signal: PIODCCLK */ 
#define PIO_PA30X1_WKUP11_PIODC6   (1u << 30) /**< \brief Pioa signal: WKUP11/PIODC6 */ 
#define PIO_PA15X1_WKUP14_PIODCEN1 (1u << 15) /**< \brief Pioa signal: WKUP14/PIODCEN1 */ 
#define PIO_PA16X1_WKUP15_PIODCEN2 (1u << 16) /**< \brief Pioa signal: WKUP15/PIODCEN2 */ 
/* ========== Pio definition for PMC peripheral ========== */
#define PIO_PA6B_PCK0              (1u << 6)  /**< \brief Pmc signal: PCK0 */ 
#define PIO_PB13B_PCK0             (1u << 13) /**< \brief Pmc signal: PCK0 */ 
#define PIO_PA17B_PCK1             (1u << 17) /**< \brief Pmc signal: PCK1 */ 
#define PIO_PA21B_PCK1             (1u << 21) /**< \brief Pmc signal: PCK1 */ 
#define PIO_PA18B_PCK2             (1u << 18) /**< \brief Pmc signal: PCK2 */ 
#define PIO_PA31B_PCK2             (1u << 31) /**< \brief Pmc signal: PCK2 */ 
#define PIO_PB3B_PCK2              (1u << 3)  /**< \brief Pmc signal: PCK2 */ 
/* ========== Pio definition for PWM peripheral ========== */
#define PIO_PA9C_PWMFI0            (1u << 9)  /**< \brief Pwm signal: PWMFI0 */ 
#define PIO_PA0A_PWMH0             (1u << 0)  /**< \brief Pwm signal: PWMH0 */ 
#define PIO_PA11B_PWMH0            (1u << 11) /**< \brief Pwm signal: PWMH0 */ 
#define PIO_PA23B_PWMH0            (1u << 23) /**< \brief Pwm signal: PWMH0 */ 
#define PIO_PB0A_PWMH0             (1u << 0)  /**< \brief Pwm signal: PWMH0 */ 
#define PIO_PC18B_PWMH0            (1u << 18) /**< \brief Pwm signal: PWMH0 */ 
#define PIO_PA1A_PWMH1             (1u << 1)  /**< \brief Pwm signal: PWMH1 */ 
#define PIO_PA12B_PWMH1            (1u << 12) /**< \brief Pwm signal: PWMH1 */ 
#define PIO_PA24B_PWMH1            (1u << 24) /**< \brief Pwm signal: PWMH1 */ 
#define PIO_PB1A_PWMH1             (1u << 1)  /**< \brief Pwm signal: PWMH1 */ 
#define PIO_PC19B_PWMH1            (1u << 19) /**< \brief Pwm signal: PWMH1 */ 
#define PIO_PA2A_PWMH2             (1u << 2)  /**< \brief Pwm signal: PWMH2 */ 
#define PIO_PA13B_PWMH2            (1u << 13) /**< \brief Pwm signal: PWMH2 */ 
#define PIO_PA25B_PWMH2            (1u << 25) /**< \brief Pwm signal: PWMH2 */ 
#define PIO_PB4B_PWMH2             (1u << 4)  /**< \brief Pwm signal: PWMH2 */ 
#define PIO_PC20B_PWMH2            (1u << 20) /**< \brief Pwm signal: PWMH2 */ 
#define PIO_PA7B_PWMH3             (1u << 7)  /**< \brief Pwm signal: PWMH3 */ 
#define PIO_PA14B_PWMH3            (1u << 14) /**< \brief Pwm signal: PWMH3 */ 
#define PIO_PA17C_PWMH3            (1u << 17) /**< \brief Pwm signal: PWMH3 */ 
#define PIO_PB14B_PWMH3            (1u << 14) /**< \brief Pwm signal: PWMH3 */ 
#define PIO_PC21B_PWMH3            (1u << 21) /**< \brief Pwm signal: PWMH3 */ 
#define PIO_PA19B_PWML0            (1u << 19) /**< \brief Pwm signal: PWML0 */ 
#define PIO_PB5B_PWML0             (1u << 5)  /**< \brief Pwm signal: PWML0 */ 
#define PIO_PC0B_PWML0             (1u << 0)  /**< \brief Pwm signal: PWML0 */ 
#define PIO_PC13B_PWML0            (1u << 13) /**< \brief Pwm signal: PWML0 */ 
#define PIO_PA20B_PWML1            (1u << 20) /**< \brief Pwm signal: PWML1 */ 
#define PIO_PB12A_PWML1            (1u << 12) /**< \brief Pwm signal: PWML1 */ 
#define PIO_PC1B_PWML1             (1u << 1)  /**< \brief Pwm signal: PWML1 */ 
#define PIO_PC15B_PWML1            (1u << 15) /**< \brief Pwm signal: PWML1 */ 
#define PIO_PA16C_PWML2            (1u << 16) /**< \brief Pwm signal: PWML2 */ 
#define PIO_PA30A_PWML2            (1u << 30) /**< \brief Pwm signal: PWML2 */ 
#define PIO_PB13A_PWML2            (1u << 13) /**< \brief Pwm signal: PWML2 */ 
#define PIO_PC2B_PWML2             (1u << 2)  /**< \brief Pwm signal: PWML2 */ 
#define PIO_PA15C_PWML3            (1u << 15) /**< \brief Pwm signal: PWML3 */ 
#define PIO_PC3B_PWML3             (1u << 3)  /**< \brief Pwm signal: PWML3 */ 
#define PIO_PC22B_PWML3            (1u << 22) /**< \brief Pwm signal: PWML3 */ 
/* ========== Pio definition for SPI peripheral ========== */
#define PIO_PA12A_MISO             (1u << 12) /**< \brief Spi signal: MISO */ 
#define PIO_PA13A_MOSI             (1u << 13) /**< \brief Spi signal: MOSI */ 
#define PIO_PA11A_NPCS0            (1u << 11) /**< \brief Spi signal: NPCS0 */ 
#define PIO_PA9B_NPCS1             (1u << 9)  /**< \brief Spi signal: NPCS1 */ 
#define PIO_PA31A_NPCS1            (1u << 31) /**< \brief Spi signal: NPCS1 */ 
#define PIO_PB14A_NPCS1            (1u << 14) /**< \brief Spi signal: NPCS1 */ 
#define PIO_PC4B_NPCS1             (1u << 4)  /**< \brief Spi signal: NPCS1 */ 
#define PIO_PA10B_NPCS2            (1u << 10) /**< \brief Spi signal: NPCS2 */ 
#define PIO_PA30B_NPCS2            (1u << 30) /**< \brief Spi signal: NPCS2 */ 
#define PIO_PB2B_NPCS2             (1u << 2)  /**< \brief Spi signal: NPCS2 */ 
#define PIO_PA3B_NPCS3             (1u << 3)  /**< \brief Spi signal: NPCS3 */ 
#define PIO_PA5B_NPCS3             (1u << 5)  /**< \brief Spi signal: NPCS3 */ 
#define PIO_PA22B_NPCS3            (1u << 22) /**< \brief Spi signal: NPCS3 */ 
#define PIO_PA14A_SPCK             (1u << 14) /**< \brief Spi signal: SPCK */ 
/* ========== Pio definition for SSC peripheral ========== */
#define PIO_PA18A_RD               (1u << 18) /**< \brief Ssc signal: RD */ 
#define PIO_PA20A_RF               (1u << 20) /**< \brief Ssc signal: RF */ 
#define PIO_PA19A_RK               (1u << 19) /**< \brief Ssc signal: RK */ 
#define PIO_PA17A_TD               (1u << 17) /**< \brief Ssc signal: TD */ 
#define PIO_PA15A_TF               (1u << 15) /**< \brief Ssc signal: TF */ 
#define PIO_PA16A_TK               (1u << 16) /**< \brief Ssc signal: TK */ 
/* ========== Pio definition for TC0 peripheral ========== */
#define PIO_PA4B_TCLK0             (1u << 4)  /**< \brief Tc0 signal: TCLK0 */ 
#define PIO_PA28B_TCLK1            (1u << 28) /**< \brief Tc0 signal: TCLK1 */ 
#define PIO_PA29B_TCLK2            (1u << 29) /**< \brief Tc0 signal: TCLK2 */ 
#define PIO_PA0B_TIOA0             (1u << 0)  /**< \brief Tc0 signal: TIOA0 */ 
#define PIO_PA15B_TIOA1            (1u << 15) /**< \brief Tc0 signal: TIOA1 */ 
#define PIO_PA26B_TIOA2            (1u << 26) /**< \brief Tc0 signal: TIOA2 */ 
#define PIO_PA1B_TIOB0             (1u << 1)  /**< \brief Tc0 signal: TIOB0 */ 
#define PIO_PA16B_TIOB1            (1u << 16) /**< \brief Tc0 signal: TIOB1 */ 
#define PIO_PA27B_TIOB2            (1u << 27) /**< \brief Tc0 signal: TIOB2 */ 
/* ========== Pio definition for TC1 peripheral ========== */
#define PIO_PC25B_TCLK3            (1u << 25) /**< \brief Tc1 signal: TCLK3 */ 
#define PIO_PC28B_TCLK4            (1u << 28) /**< \brief Tc1 signal: TCLK4 */ 
#define PIO_PC31B_TCLK5            (1u << 31) /**< \brief Tc1 signal: TCLK5 */ 
#define PIO_PC23B_TIOA3            (1u << 23) /**< \brief Tc1 signal: TIOA3 */ 
#define PIO_PC26B_TIOA4            (1u << 26) /**< \brief Tc1 signal: TIOA4 */ 
#define PIO_PC29B_TIOA5            (1u << 29) /**< \brief Tc1 signal: TIOA5 */ 
#define PIO_PC24B_TIOB3            (1u << 24) /**< \brief Tc1 signal: TIOB3 */ 
#define PIO_PC27B_TIOB4            (1u << 27) /**< \brief Tc1 signal: TIOB4 */ 
#define PIO_PC30B_TIOB5            (1u << 30) /**< \brief Tc1 signal: TIOB5 */ 
/* ========== Pio definition for TWI0 peripheral ========== */
#define PIO_PA4A_TWCK0             (1u << 4)  /**< \brief Twi0 signal: TWCK0 */ 
#define PIO_PA3A_TWD0              (1u << 3)  /**< \brief Twi0 signal: TWD0 */ 
/* ========== Pio definition for TWI1 peripheral ========== */
#define PIO_PB5A_TWCK1             (1u << 5)  /**< \brief Twi1 signal: TWCK1 */ 
#define PIO_PB4A_TWD1              (1u << 4)  /**< \brief Twi1 signal: TWD1 */ 
/* ========== Pio definition for UART0 peripheral ========== */
#define PIO_PA9A_URXD0             (1u << 9)  /**< \brief Uart0 signal: URXD0 */ 
#define PIO_PA10A_UTXD0            (1u << 10) /**< \brief Uart0 signal: UTXD0 */ 
/* ========== Pio definition for UART1 peripheral ========== */
#define PIO_PB2A_URXD1             (1u << 2)  /**< \brief Uart1 signal: URXD1 */ 
#define PIO_PB3A_UTXD1             (1u << 3)  /**< \brief Uart1 signal: UTXD1 */ 
/* ========== Pio definition for USART0 peripheral ========== */
#define PIO_PA8A_CTS0              (1u << 8)  /**< \brief Usart0 signal: CTS0 */ 
#define PIO_PA7A_RTS0              (1u << 7)  /**< \brief Usart0 signal: RTS0 */ 
#define PIO_PA5A_RXD0              (1u << 5)  /**< \brief Usart0 signal: RXD0 */ 
#define PIO_PA2B_SCK0              (1u << 2)  /**< \brief Usart0 signal: SCK0 */ 
#define PIO_PA6A_TXD0              (1u << 6)  /**< \brief Usart0 signal: TXD0 */ 
/* ========== Pio definition for USART1 peripheral ========== */
#define PIO_PA25A_CTS1             (1u << 25) /**< \brief Usart1 signal: CTS1 */ 
#define PIO_PA26A_DCD1             (1u << 26) /**< \brief Usart1 signal: DCD1 */ 
#define PIO_PA28A_DSR1             (1u << 28) /**< \brief Usart1 signal: DSR1 */ 
#define PIO_PA27A_DTR1             (1u << 27) /**< \brief Usart1 signal: DTR1 */ 
#define PIO_PA29A_RI1              (1u << 29) /**< \brief Usart1 signal: RI1 */ 
#define PIO_PA24A_RTS1             (1u << 24) /**< \brief Usart1 signal: RTS1 */ 
#define PIO_PA21A_RXD1             (1u << 21) /**< \brief Usart1 signal: RXD1 */ 
#define PIO_PA23A_SCK1             (1u << 23) /**< \brief Usart1 signal: SCK1 */ 
#define PIO_PA22A_TXD1             (1u << 22) /**< \brief Usart1 signal: TXD1 */ 
/*@}*/

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAM3S16 */
/* ************************************************************************** */

#define IFLASH_SIZE 0x100000
#define IRAM_SIZE   0x20000

#define IFLASH_ADDR  (0x00400000u) /**< Internal Flash base address */
#define IROM_ADDR    (0x00800000u) /**< Internal ROM base address */
#define IRAM_ADDR    (0x20000000u) /**< Internal RAM base address */
#define EBI_CS0_ADDR (0x60000000u) /**< EBI Chip Select 0 base address */
#define EBI_CS1_ADDR (0x61000000u) /**< EBI Chip Select 1 base address */
#define EBI_CS2_ADDR (0x62000000u) /**< EBI Chip Select 2 base address */
#define EBI_CS3_ADDR (0x63000000u) /**< EBI Chip Select 3 base address */

#define IFLASH_PAGE_SIZE        512
#define IFLASH_LOCK_REGION_SIZE 32768
#define IFLASH_NB_OF_PAGES      2048
#define IFLASH_NB_OF_LOCK_BITS  32

#ifdef __cplusplus
}
#endif

/*@}*/

#endif /* SAM3S16_H */
